word = input("εισάγετε συμβολοσειρά: ") #ζητάει από τον χρήστη να πληκτρολογήσει μια λέξη/συμβολοσειρά
while (word != "" and word != " "): #ξεκινάει loop μέχρι ο χρήστης να δώσει κενή ή άδεια συμβολοσειρά  
    if str(word) == str(word)[::-1]: #με βήμα -1 ,αριστερόστροφα ελέγχεται εαν κάθε γράμμα τις λέξης που δόθηκε ισούται με καθε γράμμα της αντίστοιχης αντεστραμένης λέξης
     print("Παλίνδρομη")
    else:
     print("οχι παλίνδρομη")
    word = input("εισάγετε συμβολοσειρά: ") #ζητάει ξανα από τον χρήστη να εισάγει λέξη/συμβολοσειρά μέχρι να τερματιστεί το loop

